cseapp/app/models/user.rb

  def add_friend(friend_id)
    friend = User.find(friend_id.id)
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]