cseapp/app/controllers/profiles_controller.rb

    def update
        @profile = current_user.profile || current_user.build_profile
        if @profile.update(profile_params)
---
UPDATE "users" SET "updated_at" = ?, "twitter" = ?, "linkedin" = ? WHERE "users"."id" = ?  [["updated_at", "2024-12-21 18:19:33.147850"], ["twitter", "https://www.linkedin.com/in/ahmetboraeryazgan/"], ["linkedin", "https://www.linkedin.com/in/ahmetboraeryazgan/"], ["id", 10]]