cseapp/app/controllers/rooms_controller.rb

  def show
    @single_room = Room.find(params[:id]) # Odayı buluyoruz
    @room = Room.new # Yeni bir oda oluşturuluyor
    @rooms = Room.public_rooms # Yalnızca public odaları alıyoruz

    @message = Message.new # Yeni bir mesaj oluşturuluyor
    @messages = @single_room.messages.order(created_at: :asc) # Odadaki tüm mesajlar sıralanıyor
---
SELECT "rooms".* FROM "rooms" WHERE "rooms"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "messages".* FROM "messages" WHERE "messages"."room_id" = ? ORDER BY "messages"."created_at" ASC  [["room_id", 4]]

  def create
    @room = Room.new(room_params)

    if @room.save
---
INSERT INTO "rooms" ("name", "is_private", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Fifth Wall"], ["is_private", 0], ["created_at", "2022-01-28 08:06:16.614099"], ["updated_at", "2022-01-28 08:06:16.614099"]]